import Product from "./product.js";

export const products = {

    vegetarian: [

        new Product(1, 'Ясаи', 35, './products/asai.jpg' , 0,
            ['Айсберг', 'Огурец', 'Авокадо', 'Морковь', 'Сладкий перец', 'Кунжут', 'Кольраби маринованная']),
        new Product(2, 'Парадайс', 36, './products/paradise.jpg' , 0,
            ['Салат Айсберг', 'Помидор', 'Огурец', 'Авокадо', 'Сладкий картофель']),
        new Product(3, 'Веган', 38, './products/vegan.jpg' , 0,
            ['Айсберг', 'Огурец', 'Морковь', 'Батат', 'Авокадо', 'Терияки', 'Пряный соус']),
        new Product(4, 'Рио', 39,  './products/rio.jpg'  , 0,
            ['Салат Айсберг', 'Помидор', 'Огурец', 'Авокадо', 'Сладкий картофель', 'Иритис', 'Соус Гуакамоле'])
    ],

    regular: [
        new Product(5, 'Дракон', 40,  './products/dragon.jpg'  , 0,
            ['Креветки', 'Огурец', 'Авокадо', 'Тобико', 'Угорь', 'Терияки', 'Кунжут']),
        new Product(6, 'Токио', 39, './products/tokio.jpg' , 0,
            ['Лосось', 'Огурец', 'Лук-порей', 'Авокадо', 'Тунец', 'Иритис']),
        new Product(7, 'Самурай', 39,  './products/samurai.jpg'  , 0,
            ['Лосось', 'Авокадо', 'Сливочный сыр', 'Огурец', 'Икра лосося']),
        new Product(8, 'Динамит', 39,  './products/dynamite.jpg'  , 0,
            ['Запеченный лосось', 'Огурец', 'Кольраби маринованная', 'Авокадо']),
        new Product(9, 'Канада', 40, './products/canada.jpg' , 0,
            ['Сливочный сыр', 'Авокадо', 'Огурец', 'Угорь', 'Лосось', 'Креветки', 'Тунец']),
        new Product(10, 'Калифорния', 39, './products/california.jpg' , 0,
            ['Креветки', 'Лосось', 'Огурец', 'Авокадо', 'Тобико']),
        new Product(11, 'Сансет', 38, './products/sunrise.jpg' , 0,
            ['Сладкий картофель', 'Авокадо', 'Запеченный лосось', 'Жареный лосось', 'Пряный соус', 'Терияки', 'Ирит']),
        new Product(12, 'Филадельфия', 38, './products/philadelphia.jpg' , 0,
            ['Сливочный сыр', 'Огурец', 'Авокадо', 'Лук зеленый', 'Лосось']),
        new Product(13, 'Аляска', 39,  './products/alaska.jpg'  , 0,
            ['Сливочный сыр', 'Огурец', 'Лосось', 'Авокадо', 'Креветки']),
        new Product(14, 'Грин', 39,  './products/green.jpg'  , 0,
            ['Огурец', 'Авокадо', 'Лосось', 'Тунец', 'Иритис'])
    ],

    set: [
        new Product(15, 'Окинава', 160,  './products/Okinawa.jpg'  , 0, ['Маки лосось', 'Ясай', 'Грин', 'Калифорния', 'Филадельфия']),
        new Product(16, 'Сакура', 120,  './products/Sakura.jpg'  , 0, ['Сэндвич с авокадо и сладким картофелем', 'Маки с авокадо', 'Ясай', 'Парадиз'])
    ],

    doneButtons:
        {
            remove: 'Убрать',
            buy: 'Выбрать',
            order: 'Заказать'
        },

    check:
        {
            info: 'Счет на оплату',
            passport: 'т.з.',
            id: 'Номер заказа',
            date: 'Дата',
            item: 'Имя',
            number: 'Кол-во',
            price: 'Цена',
            amount: 'Сумма',
            sale: 'Скидка',
            topay: 'К оплате'
        }
}



export const categoryNames = {
    vegetarian: 'Веган',
    regular: 'Особые',
    set: 'Комбо',
    // salads: 'salads',
    // nigiri: 'nigiri',
    // maki: 'maki',
    // sushi: 'gunkan',
    // sandwiches: 'sandwiches'
}



